In [2]:
import pandas as pd
#Define a dictionary 'x'
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [3]:
#Retrieving the "ID" column and assigning it to a variable x
ids = df[['ID']]
ids

   ID
0   1
1   2
2   3
3   4

In [4]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [5]:
dict = {
        "Students": ["David","Samuel","Terry","Evan"], 
       "Age":[27,24,22,32],
       "Country":["UK","Canada","China","USA"],
       "Course":["Python","Data Structure","Machine Learning","Web Development"],
       "Marks":[85,72,89,76]
       }
df = pd.DataFrame(dict)
df

  Students  Age Country            Course  Marks
0    David   27      UK            Python     85
1   Samuel   24  Canada    Data Structure     72
2    Terry   22   China  Machine Learning     89
3     Evan   32     USA   Web Development     76

In [6]:
# Retrieving one column
b = df["Marks"]
b

0    85
1    72
2    89
3    76
Name: Marks, dtype: int64

In [7]:
# Retrieving more than one columns
c = df[["Country","Course"]]
c

  Country            Course
0      UK            Python
1  Canada    Data Structure
2   China  Machine Learning
3     USA   Web Development

loc() and iloc() functions

In [8]:
# Access the value on the first row and the first column
df.iloc[0,0]

'David'

In [9]:
# Access the column using the name

df.loc[0, 'Students']

'David'

Slicing

Slicing uses the [] operator to select a set of rows and/or columns from a DataFrame.

When slicing in pandas, the start bound is included in the output

In [10]:
df

  Students  Age Country            Course  Marks
0    David   27      UK            Python     85
1   Samuel   24  Canada    Data Structure     72
2    Terry   22   China  Machine Learning     89
3     Evan   32     USA   Web Development     76

In [11]:
df.iloc[0:2, 0:3]

  Students  Age Country
0    David   27      UK
1   Samuel   24  Canada

In [12]:
df.loc[0:1,'Age':'Country']

   Age Country
0   27      UK
1   24  Canada

In [13]:
import sys
print(f"Python executable: {sys.executable}")

Python executable: c:\GitHub\_LEARNING PROJECTS\ml_project\.venv\Scripts\python.exe

In [14]:
import pandas as pd

Read data from CSV file

In [15]:
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv'
df = pd.read_csv(csv_path)

In [16]:
# Print first five rows of the dataframe
df.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

Read data from Excel

In [17]:
xlsx_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/n9LOuKI9SlUa1b5zkaCMeg/Product-sales.xlsx'
df = pd.read_excel(xlsx_path)
df.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [18]:
# Access to the column Length
x = df[['Quantity']]
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [19]:
# Get the column as a series
x = df['Product']
x

0        Laptop
1    Smartphone
2    Desk Chair
3      Notebook
4       Monitor
Name: Product, dtype: object

In [20]:
# Get the column as a dataframe
x = df[['Product']]
x

      Product
0      Laptop
1  Smartphone
2  Desk Chair
3    Notebook
4     Monitor

In [21]:
# Access to multiple columns

y = df[['Product','Category', 'Quantity']]
y

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1